hamed-ta/STM32F1/nRF24L01/Examples/TR/nrf24.cpp
/********************************************************************************
*nRF24L01+ STM32F1 Library written By LonelyWolf (https://github.com/LonelyWolf)*
*                       Ported for c++ By Hamed Tahery                          *
*                             Hamed.t@live.com                                  *
*********************************************************************************
*                          Sunday, November 6, 2016                             *
*********************************************************************************/
#include "nrf24.h"
//--------------------------------------------------------------------
//--------------------------------------------------------------------
void nRF24_SPI_Init(uint16_t prescaler) 
	{
		SPI_InitTypeDef SPI;
		
		SPI.SPI_Mode = SPI_Mode_Master;
		SPI.SPI_BaudRatePrescaler = prescaler;
		SPI.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
		SPI.SPI_CPOL = SPI_CPOL_Low;
		SPI.SPI_CPHA = SPI_CPHA_1Edge;
		SPI.SPI_CRCPolynomial = 7;
		SPI.SPI_DataSize = SPI_DataSize_8b;
		SPI.SPI_FirstBit = SPI_FirstBit_MSB;
		SPI.SPI_NSS = SPI_NSS_Soft;
		SPI_Init(SPI_PORT,&SPI);
	  // NSS must be set to '1' due to NSS_Soft settings (otherwise it will be Multimaster mode).
		SPI_NSSInternalSoftwareConfig(SPI_PORT,SPI_NSSInternalSoft_Set);
		SPI_Cmd(SPI_PORT, ENABLE);
}
//--------------------------------------------------------------------
void nRF24_GPIO_Init(void) 
{
    GPIO_InitTypeDef PORT;
    // Enable the nRF24L01 GPIO peripherals
		RCC->APB2ENR |= nRF24_GPIO_PERIPHERALS;
		#if nRF24_SPI_PORT == 1
		// SPI1
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_SPI1 | RCC_APB2Periph_GPIOA,ENABLE);
		#elif nRF24_SPI_PORT == 2
		// SPI2
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB,ENABLE);
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_SPI2,ENABLE);
		#elif nRF24_SPI_PORT == 3
		// SPI3
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB | RCC_APB2Periph_AFIO,ENABLE);
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_SPI3,ENABLE);
		GPIO_PinRemapConfig(GPIO_Remap_SWJ_JTAGDisable, ENABLE); // Disable JTAG for use PB3
		#endif
		// Configure SPI pins
		PORT.GPIO_Speed = GPIO_Speed_50MHz;
		PORT.GPIO_Pin = SPI_SCK_PIN | SPI_MISO_PIN | SPI_MOSI_PIN;
		PORT.GPIO_Mode = GPIO_Mode_AF_PP;
		GPIO_Init(SPI_GPIO_PORT,&PORT);
		// Configure CSN pin as output with Push-
		PORT.GPIO_Speed = GPIO_Speed_2MHz;
		PORT.GPIO_Pin = nRF24_CSN_PIN;
		PORT.GPIO_Mode = GPIO_Mode_Out_PP;
		GPIO_Init(nRF24_CSN_PORT,&PORT);
		// Configure CE pin as output with Push-Pull
		PORT.GPIO_Pin = nRF24_CE_PIN;
		PORT.GPIO_Mode = GPIO_Mode_Out_PP;
		GPIO_Init(nRF24_CE_PORT,&PORT);
		// Configure IRQ pin as input with Pull-Up
		PORT.GPIO_Pin = nRF24_IRQ_PIN;
		PORT.GPIO_Mode = GPIO_Mode_IPU;
		GPIO_Init(nRF24_IRQ_PORT,&PORT);

		nRF24_SPI_Init(SPI_BaudRatePrescaler_2); // Which SPI speed do we need?
		
		nRF24_CSN_H();		
		nRF24_CE_L();
}
//--------------------------------------------------------------------
// Low level SPI transmit/receive function (hardware depended)
// input:
//   data - value to transmit via SPI
// return: value received from SPI
uint8_t nRF24_LL_RW(uint8_t data) 
{
	 // Wait until TX buffer is empty
	while (SPI_I2S_GetFlagStatus(SPI_PORT, SPI_I2S_FLAG_TXE) == RESET);
	// Send byte to SPI (TXE cleared)
	SPI_I2S_SendData(SPI_PORT, data);
	// Wait while receive buffer is empty
	while (SPI_I2S_GetFlagStatus(SPI_PORT, SPI_I2S_FLAG_RXNE) == RESET);

	// Return received byte
	return (uint8_t)SPI_I2S_ReceiveData(SPI_PORT);
}
//--------------------------------------------------------------------
// Read a register
// input:
//   reg - number of register to read
// return: value of register
static uint8_t nRF24_ReadReg(uint8_t reg) 
{
	uint8_t value;

	nRF24_CSN_L();
	nRF24_LL_RW(reg & nRF24_MASK_REG_MAP);
	value = nRF24_LL_RW(nRF24_CMD_NOP);
	nRF24_CSN_H();

	return value;
}
//--------------------------------------------------------------------
// Write a new value to register
// input:
//   reg - number of register to write
//   value - value to write
static void nRF24_WriteReg(uint8_t reg, uint8_t value) 
{
	nRF24_CSN_L();
	if (reg < nRF24_CMD_W_REGISTER) 
		{
			// This is a register access
			nRF24_LL_RW(nRF24_CMD_W_REGISTER | (reg & nRF24_MASK_REG_MAP));
			nRF24_LL_RW(value);
		} else 
		{
			// This is a single byte command or future command/register
			nRF24_LL_RW(reg);
			if ((reg != nRF24_CMD_FLUSH_TX) && (reg != nRF24_CMD_FLUSH_RX) && (reg != nRF24_CMD_REUSE_TX_PL) && (reg != nRF24_CMD_NOP)) 
			{
				// Send register value
				nRF24_LL_RW(value);
			}
	}
	nRF24_CSN_H();
}
//--------------------------------------------------------------------
// Read a multi-byte register
// input:
//   reg - number of register to read
//   pBuf - pointer to the buffer for register data
//   count - number of bytes to read
static void nRF24_ReadMBReg(uint8_t reg, uint8_t *pBuf, uint8_t count) 
{
	nRF24_CSN_L();
	nRF24_LL_RW(reg);
	while (count--) 
		{
			*pBuf++ = nRF24_LL_RW(nRF24_CMD_NOP);
		}
	nRF24_CSN_H();
}
//--------------------------------------------------------------------
// Write a multi-byte register
// input:
//   reg - number of register to write
//   pBuf - pointer to the buffer with data to write
//   count - number of bytes to write
static void nRF24_WriteMBReg(uint8_t reg, uint8_t *pBuf, uint8_t count) 
{
	nRF24_CSN_L();
	nRF24_LL_RW(reg);
	while (count--) 
		{
			nRF24_LL_RW(*pBuf++);
		}
	nRF24_CSN_H();
}
//------------------------------------------------------
// Flush the TX FIFO
void nRF24_FlushTX(void) 
{
	nRF24_WriteReg(nRF24_CMD_FLUSH_TX, nRF24_CMD_NOP);
}
//------------------------------------------------------
// Flush the RX FIFO
void nRF24_FlushRX(void) 
{
	nRF24_WriteReg(nRF24_CMD_FLUSH_RX, nRF24_CMD_NOP);
}
//--------------------------------------------------------------------
//--------------------------------------------------------------------
//--------------------------------------------------------------------
//--------------------------------------------------------------------
Nrf24::Nrf24(void)
{

