hamed-ta/STM32F1/nRF24L01/Examples/TR/nrf24.cpp
	// Deassert the CE pin (Standby-II --> Standby-I)
	nRF24_CE_L();

	if (!wait) 
		{
			// Timeout
			return nRF24_TX_TIMEOUT;
		}

	// Check the flags in STATUS register
	//UART_SendStr("[");
	//UART_SendHex8(status);
	//UART_SendStr("] ");

	// Clear pending IRQ flags
    ClearIRQFlags();

	if (status & nRF24_FLAG_MAX_RT) 
		{
			// Auto retransmit counter exceeds the programmed maximum limit (FIFO is not removed)
			return nRF24_TX_MAXRT;
		} else

	if (status & nRF24_FLAG_TX_DS) 
		{
			// Successful transmission
			return nRF24_TX_SUCCESS;
		}

		// Some banana happens, a payload remains in the TX FIFO, flush it
		nRF24_FlushTX();

	return nRF24_TX_ERROR;
}
//--------------------------------------------------------------------
void Nrf24::PowerUp(void)
{
	SetPowerMode(nRF24_PWR_UP);
}
//--------------------------------------------------------------------
void Nrf24::PowerDown(void)
{
	nRF24_CE_L();
	SetPowerMode(nRF24_PWR_DOWN);
}
//--------------------------------------------------------------------
void Nrf24::SetRxMode(void)
{
   PowerUp();
	 SetOperationalMode(nRF24_MODE_RX);
	 ClearIRQFlags();
	 nRF24_CE_H();
}
//--------------------------------------------------------------------
bool Nrf24::DataAvailable (void)
{
  return(GetStatus_RXFIFO() != nRF24_STATUS_RXFIFO_EMPTY);
}
//--------------------------------------------------------------------
void Nrf24::SetTxMode (void)
{
	PowerUp();
	SetOperationalMode(nRF24_MODE_TX);
	ClearIRQFlags();
}
//--------------------------------------------------------------------
uint8_t Nrf24::GetRFChannel (void)
{
   return nRF24_ReadReg(nRF24_REG_RF_CH);
}
//--------------------------------------------------------------------
// Print nRF24L01+ current configuration (for debug purposes)
/*void nRF24_DumpConfig(void) 
	{
		//--------------------------------------------------------------------
		
	uint8_t i,j;
	uint8_t aw;
	uint8_t buf[5];

	// Dump nRF24L01+ configuration
	// CONFIG
	i = nRF24_ReadReg(nRF24_REG_CONFIG);
	USART_printf(USART1,"[0x%02X] 0x%02X MASK:%03b CRC:%02b PWR:%s MODE:P%s\r\n",
			nRF24_REG_CONFIG,
			i,
			i >> 4,
			(i & 0x0c) >> 2,
			(i & 0x02) ? "ON" : "OFF",
			(i & 0x01) ? "RX" : "TX"
		);
	// EN_AA
	i = nRF24_ReadReg(nRF24_REG_EN_AA);
	USART_printf(USART1,"[0x%02X] 0x%02X ENAA: ",nRF24_REG_EN_AA,i);
	for (j = 0; j < 6; j++) {
		USART_printf(USART1,"[P%1u%s]%s",j,
				(i & (1 << j)) ? "+" : "-",
				(j == 5) ? "\r\n" : " "
			);
	}
	// EN_RXADDR
	i = nRF24_ReadReg(nRF24_REG_EN_RXADDR);
	USART_printf(USART1,"[0x%02X] 0x%02X EN_RXADDR: ",nRF24_REG_EN_RXADDR,i);
	for (j = 0; j < 6; j++) {
		USART_printf(USART1,"[P%1u%s]%s",j,
				(i & (1 << j)) ? "+" : "-",
				(j == 5) ? "\r\n" : " "
			);
	}
	// SETUP_AW
	i = nRF24_ReadReg(nRF24_REG_SETUP_AW);
	aw = (i & 0x03) + 2;
	USART_printf(USART1,"[0x%02X] 0x%02X EN_RXADDR=%06b (address width = %u)\r\n",nRF24_REG_SETUP_AW,i,i & 0x03,aw);
	// SETUP_RETR
	i = nRF24_ReadReg(nRF24_REG_SETUP_RETR);
	USART_printf(USART1,"[0x%02X] 0x%02X ARD=%04b ARC=%04b (retr.delay=%uus, count=%u)\r\n",
			nRF24_REG_SETUP_RETR,
			i,
			i >> 4,
			i & 0x0F,
			((i >> 4) * 250) + 250,
			i & 0x0F
		);
	// RF_CH
	i = nRF24_ReadReg(nRF24_REG_RF_CH);
	USART_printf(USART1,"[0x%02X] 0x%02X (%.3uGHz)\r\n",nRF24_REG_RF_CH,i,2400 + i);
	// RF_SETUP
	i = nRF24_ReadReg(nRF24_REG_RF_SETUP);
	USART_printf(USART1,"[0x%02X] 0x%02X CONT_WAVE:%s PLL_LOCK:%s DataRate=",
			nRF24_REG_RF_SETUP,
			i,
			(i & 0x80) ? "ON" : "OFF",
			(i & 0x80) ? "ON" : "OFF"
		);
	switch ((i & 0x28) >> 3) {
		case 0x00:
			USART_printf(USART1,"1M");
			break;
		case 0x01:
			USART_printf(USART1,"2M");
			break;
		case 0x04:
			USART_printf(USART1,"250k");
			break;
		default:
			USART_printf(USART1,"???");
			break;
	}
	USART_printf(USART1,"pbs RF_PWR=");
	switch ((i & 0x06) >> 1) {
		case 0x00:
			USART_printf(USART1,"-18");
			break;
		case 0x01:
			USART_printf(USART1,"-12");
			break;
		case 0x02:
			USART_printf(USART1,"-6");
			break;
		case 0x03:
			USART_printf(USART1,"0");
			break;
		default:
			USART_printf(USART1,"???");
			break;
	}
	USART_printf(USART1,"dBm\r\n");
	// STATUS
	i = nRF24_ReadReg(nRF24_REG_STATUS);
	USART_printf(USART1,"[0x%02X] 0x%02X IRQ:%03b RX_PIPE:%u TX_FULL:%s\r\n",
			nRF24_REG_STATUS,
			i,
			(i & 0x70) >> 4,
			(i & 0x0E) >> 1,
			(i & 0x01) ? "YES" : "NO"
		);
	// OBSERVE_TX
	i = nRF24_ReadReg(nRF24_REG_OBSERVE_TX);
	USART_printf(USART1,"[0x%02X] 0x%02X PLOS_CNT=%u ARC_CNT=%u\r\n",nRF24_REG_OBSERVE_TX,i,i >> 4,i & 0x0F);
	// RPD
	i = nRF24_ReadReg(nRF24_REG_RPD);
	USART_printf(USART1,"[0x%02X] 0x%02X RPD=%s\r\n",nRF24_REG_RPD,i,(i & 0x01) ? "YES" : "NO");
	// RX_ADDR_P0
	nRF24_ReadMBReg(nRF24_REG_RX_ADDR_P0,buf,aw);
	USART_printf(USART1,"[0x%02X] RX_ADDR_P0 \"",nRF24_REG_RX_ADDR_P0);
	for (i = 0; i < aw; i++) USART_printf(USART1,"%c",buf[i]);
	USART_printf(USART1,"\"\r\n");
	// RX_ADDR_P1
	nRF24_ReadMBReg(nRF24_REG_RX_ADDR_P1,buf,aw);
	USART_printf(USART1,"[0x%02X] RX_ADDR_P1 \"",nRF24_REG_RX_ADDR_P1);
	for (i = 0; i < aw; i++) USART_printf(USART1,"%c",buf[i]);
	USART_printf(USART1,"\"\r\n");
	// RX_ADDR_P2
	USART_printf(USART1,"[0x%02X] RX_ADDR_P2 \"",nRF24_REG_RX_ADDR_P2);
	for (i = 0; i < aw - 1; i++) USART_printf(USART1,"%c",buf[i]);
	i = nRF24_ReadReg(nRF24_REG_RX_ADDR_P2);
	USART_printf(USART1,"%c\"\r\n",i);
	// RX_ADDR_P3
	USART_printf(USART1,"[0x%02X] RX_ADDR_P3 \"",nRF24_REG_RX_ADDR_P3);
	for (i = 0; i < aw - 1; i++) USART_printf(USART1,"%c",buf[i]);
	i = nRF24_ReadReg(nRF24_REG_RX_ADDR_P3);
	USART_printf(USART1,"%c\"\r\n",i);
	// RX_ADDR_P4
	USART_printf(USART1,"[0x%02X] RX_ADDR_P4 \"",nRF24_REG_RX_ADDR_P4);
	for (i = 0; i < aw - 1; i++) USART_printf(USART1,"%c",buf[i]);
	i = nRF24_ReadReg(nRF24_REG_RX_ADDR_P4);
	USART_printf(USART1,"%c\"\r\n",i);
	// RX_ADDR_P5
	USART_printf(USART1,"[0x%02X] RX_ADDR_P5 \"",nRF24_REG_RX_ADDR_P5);
	for (i = 0; i < aw - 1; i++) USART_printf(USART1,"%c",buf[i]);
	i = nRF24_ReadReg(nRF24_REG_RX_ADDR_P5);
	USART_printf(USART1,"%c\"\r\n",i);
	// TX_ADDR
	nRF24_ReadMBReg(nRF24_REG_TX_ADDR,buf,aw);
	USART_printf(USART1,"[0x%02X] TX_ADDR \"",nRF24_REG_TX_ADDR);
	for (i = 0; i < aw; i++) USART_printf(USART1,"%c",buf[i]);
	USART_printf(USART1,"\"\r\n");
	// RX_PW_P0
	i = nRF24_ReadReg(nRF24_REG_RX_PW_P0);
	USART_printf(USART1,"[0x%02X] RX_PW_P0=%u\r\n",nRF24_REG_RX_PW_P0,i);
	// RX_PW_P1
	i = nRF24_ReadReg(nRF24_REG_RX_PW_P1);
	USART_printf(USART1,"[0x%02X] RX_PW_P1=%u\r\n",nRF24_REG_RX_PW_P1,i);
	// RX_PW_P2
	i = nRF24_ReadReg(nRF24_REG_RX_PW_P2);
	USART_printf(USART1,"[0x%02X] RX_PW_P2=%u\r\n",nRF24_REG_RX_PW_P2,i);
	// RX_PW_P3
	i = nRF24_ReadReg(nRF24_REG_RX_PW_P3);
	USART_printf(USART1,"[0x%02X] RX_PW_P3=%u\r\n",nRF24_REG_RX_PW_P3,i);
	// RX_PW_P4
	i = nRF24_ReadReg(nRF24_REG_RX_PW_P4);
	USART_printf(USART1,"[0x%02X] RX_PW_P4=%u\r\n",nRF24_REG_RX_PW_P4,i);
	// RX_PW_P5
	i = nRF24_ReadReg(nRF24_REG_RX_PW_P5);
	USART_printf(USART1,"[0x%02X] RX_PW_P5=%u\r\n",nRF24_REG_RX_PW_P5,i);
}*/
//--------------------------------------------------------------------


